

// প্রাকটিস চ্যালেঞ্জ -১:  

// ক্লাস সেভের এর ফাইনাল এক্সাম এ তুমি ফার্স্ট হয়েছো। তোমার বন্ধু আলিয়া, ডালিয়া, সালিয়া, মালিয়া, লিলিয়া আর জ্বালাইয়া - তাদের grade তুমি জানো না। তবে তাদের নম্বর জানো. আলিয়া 95 পেয়েছে, ডালিয়া 66 পেয়েছে, সালিয়া 80 পেয়েছে, মালিয়া পেয়েছে 59, লিলিয়া পেয়েছে 47, জ্বালাইয়া পেয়েছে 77। তুমি JS code দিয়ে তাদের grade বের করে দিতে পারবে?

// ১) যারা ৫০ এর নিচে পেয়েছে, তাদের grade F.

// ২) যারা ৫০ বা তার উপরে পেয়েছে, অথবা ৬০ এর নিচে পেয়েছে, তাদের grade D.

// ৩) যারা ৬০ বা তার উপরে পেয়েছে, অথবা ৭০ এর নিচে পেয়েছে, তাদের grade C.

// ৪) যারা ৭০ বা তার উপরে পেয়েছে, অথবা ৮০ এর নিচে পেয়েছে, তাদের grade B.

// ৫) যারা ৮০ বা তার উপরে পেয়েছে, অথবা ৯০ এর নিচে পেয়েছে, তাদের grade A.

// ৬) যারা ৯০ বা তার উপরে পেয়েছে, তাদের grade A+.

 

// প্রাকটিস প্রব্লেম-২: 

// তাড়াহুড়া করে স্কুলের জন্য বের হচ্ছ কিন্তু রাস্তা পার হওয়ার সময় দেখলে, ট্রাফিক সিগন্যাল লাল রং। এই অবস্থায় যদি তুমি রাস্তা পার হওয়ার চেষ্টা কর, তাহলে ডেঞ্জার হতে পারে। যদি হলুদ রং হয় তাহলে তোমার থেমে যাওয়া উচিত। আর যদি ট্রাফিক সিগন্যাল গ্রিন হয় তাহলে তোমার রাস্তা পার হওয়া উচিত। তাই একটা কোড লিখে ফেলো। যেখানে আমরা signal নামে একটা ভেরিয়েবল থাকবে। সেটার মান green, yellow বা red হতে পারে। সেই অনুসারে ডিফারেন্ট ডিফারেন্ট কাজ হবে। তো, সেই কোড ফটাফট লিখে ফেলো। 

 

//প্রাকটিস চ্যালেঞ্জ-3

// প্রতিদিন তোমার কাজ কি? 

// ১) রাত ৮ টা বাজে মডিউল আনলক করো  

// ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো

// ৩) ভিডিও দেখতে দেখতে নোটস নাও 

// ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো 

// ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো 

// এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো। আবার একই জিনিস while লুপ চালিয়ে ১০ বার দেখানো। 


let list = [ '১) রাত ৮ টা বাজে মডিউল আনলক করো', 
    "২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস কর",
    "৩) ভিডিও দেখতে দেখতে নোটস নাও",
    "৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো",
 
"৫) কোন কিছু বুঝতে না পারলে  সাপোর্ট সেশনে জয়েন করো"]

for (j = 1;j<=10;j++){
    console.log(`loop num :- ${j}`);
    for(i = 0;i<list.length;i++){
        let output = list[i]
        console.log(output)
    }
}

// প্রাকটিস চ্যালেঞ্জ (৪ টি প্রব্লেম): 

// ১. একটা ফাংশন লিখবা যেটা ১৩ এর নামতা (multiplication table) আউটপুট হিসেবে দেখাবে। 

function namota(num) {
    for (var i =1;i<=10;i++) {
        result= i*num;
  console.log(`${i} * ${num} = ${result}` );
   
    }
  
}
namota(5);


// ২. একটা ফাংশন লিখবা যেটা যেকোন নামকে uppercase বা রেগুলার কেইস হিসেবে নিবে আর আউটপুট হিসেবে সেই নাম lowercase করে রিটার্ন করবে।

function prac(name) {
    let result = name.toUpperCase();
   let  value = name.toLowerCase();
   return value;
}
let myName = prac("sourav")
console.log(myName)
// ৩. fullName নামে একটা ফাংশন তৈরী কর যেটা তোমার নামের প্রথম অংশ এবং তোমার নামের শেষের অংশ প্যারামিটার হিসেবে নিবে। আর তোমার নামের দুই অংশ জোড়া দিয়ে আউটপুট হিসেবে তোমার পূর্ন নাম রিটার্ন করে দিবে। যেমন ধরো, hablu এবং kanto ইনপুট প্যারামিটার হিসেবে দিলে আউটপুট হিসেবে hablu kanto রিটার্ন করবে। 
function addName(n1,n2){
    fullName = `${n1} ${n2}`;
    return fullName;
}
let myFullName = addName('sourav','arefin')
console.log(myFullName);
// ৪. একটা ফাংশন লিখবা যেটাকে তুমি কোন সংখ্যাকে ইনপুট হিসেবে দিলে সে সেই সংখ্যার square করে সেই square কে রিটার্ন করবে।

// অর্থাৎ তুমি ইনপুট হিসেবে 5 দিলে সেটাতে স্কয়ারে হিসেবে 25 আউটপুট হিসেবে পাবে।  


function power(num) {
    value = Math.pow(num,2);
    return value;
}
let answer = power(6)
console.log(answer)

// —----------

// Extra

// —--------------

// ৫) pizza নামের একটা object কে নিচের উদাহরণ মতো define করবা :



// const pizza = {

//  toppings: ['cheese', 'sauce', 'pepperoni'],

//  crust: 'deep dish',

//  serves: 2

// }

// এবং pepperoni প্রিন্ট করবা।